/* No comment provided by engineer. */
"%.0lfk of %.0lfk" = "%1$.0lfk %2$.0lfk:sta";

/* No comment provided by engineer. */
"%@ %@ has been installed and will be ready to use next time %@ starts! Would you like to relaunch now?" = "%1$@ %2$@ on asennettu ja valmiina käytettäväksi kun %3$@ avataan seuraavan kerran! Haluatko avata uudelleen heti?";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ is currently the newest version available.";

/* No comment provided by engineer. */
"%@ %@ is now available (you have %@). Would you like to download it now?" = "%1$@ %2$@ on nyt tarjolla (asennettuna %3$@). Haluatko ladata sen nyt?";

/* No comment provided by engineer. */
"%@ does not have permission to write to the application's directory! Are you running off a disk image? If not, ask your system administrator for help." = "Käyttäjällä %@ ei ole kirjoitusoikeuksia sovelluksen kansioon! Ajoitko ohjelman levytiedostosta? Jos et, ota yhteys järjestelmän ylläpitäjään.";

/* No comment provided by engineer. */
"A new version of %@ has been installed!" = "Uusi versio %@:sta on asennettu!";

/* No comment provided by engineer. */
"A new version of %@ is available!" = "Uusi versio %@:sta on tarjolla!";

/* No comment provided by engineer. */
"An error occurred during installation. Please try again later." = "Päivityksen asennuksessa tapahtui virhe. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "Päivitystietojen haussa tapahtui virhe. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "Pakettia purkaessa tapahtui virhe. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while trying to download the file. Please try again later." = "Tiedoston latauksessa tapahtui virhe. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An update is already in progress!" = "Päivitys on jo käynnissä!";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* No comment provided by engineer. */
"Check for updates on startup?" = "Tarkistetaanko päivitykset avattaessa?";

/* No comment provided by engineer. */
"Downloading update..." = "Ladataan päivityksiä...";

/* No comment provided by engineer. */
"Extracting update..." = "Puretaan päivityspakettia...";

/* No comment provided by engineer. */
"Install and Relaunch" = "Asenna ja avaa uudelleen";

/* No comment provided by engineer. */
"Installing update..." = "Asennetaan päivityksiä...";

/* No comment provided by engineer. */
"No" = "Ei";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to install!" = "Valmiina asentamaan!";

/* No comment provided by engineer. */
"Update Error!" = "Virhe päivityksessä!";

/* No comment provided by engineer. */
"Updating %@" = "Päivitetään %@";

/* No comment provided by engineer. */
"Would you like %@ to check for updates on startup? If not, you can initiate the check manually from the application menu." = "Haluatko että %@ tarkistaa päivitykset avattaessa? Jos et, voit käynnistää tarkistuksen myös itse sovellusvalikosta.";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"You're up to date!" = "Päivitys valmis!";